atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
/***************************************************************************
 *   Copyright 2018 by Davide Bettio <davide@uninstall.it>                 *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU Lesser General Public License as        *
 *   published by the Free Software Foundation; either version 2 of the    *
 *   License, or (at your option) any later version.                       *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, write to the                         *
 *   Free Software Foundation, Inc.,                                       *
 *   51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA .        *
 ***************************************************************************/

#include "socket.h"
#include "socket_driver.h"
#include "port.h"

#include <string.h>

#include "atom.h"
#include "context.h"
#include "globalcontext.h"
#include "interop.h"
#include "utils.h"
#include "term.h"

#include "platform_defaultatoms.h"

#include <sys/types.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <errno.h>
#include <unistd.h>

#include <esp_log.h>
#include <lwip/ip_addr.h>
#include <lwip/inet.h>
#include <lwip/api.h>

#include "esp32_sys.h"
#include "sys.h"
#include "term.h"

// #define ENABLE_TRACE 1
#include "trace.h"

#define BUFSIZE 128

static void active_recv_callback(EventListener *listener);
static void passive_recv_callback(EventListener *listener);
static void active_recvfrom_callback(EventListener *listener);
static void passive_recvfrom_callback(EventListener *listener);

typedef struct SocketDriverData
{
    struct netconn *conn;
    uint64_t ref_ticks;
    term proto;
    term port;
    term controlling_process;
    term binary;
    term active;
    term buffer;
    EventListener *active_listener;
} SocketDriverData;

void *socket_driver_create_data()
{
    struct SocketDriverData *data = calloc(1, sizeof(struct SocketDriverData));
    data->conn = NULL;
    data->proto = term_invalid_term();
    data->port = term_invalid_term();
    data->controlling_process = term_invalid_term();
    data->binary = term_invalid_term();
    data->active = term_invalid_term();
    data->buffer = term_invalid_term();
    data->active_listener = NULL;

    return (void *) data;
}

void socket_driver_delete_data(void *data)
{
    free(data);
}

void socket_callback(struct netconn *netconn, enum netconn_evt evt, u16_t len)
{
    TRACE("socket: netconn callback, netconn: 0x%lx, evt: %i, len: %i\n", (unsigned long) netconn, evt, len);

    if (evt != NETCONN_EVT_RCVPLUS) {
        return;
    }

    // print_event_descriptors();
    int event_descriptor = find_event_descriptor(netconn);
    if (UNLIKELY(event_descriptor < 0)) {
        TRACE("socket: event descriptor not found in socket_callback for netconn 0x%lx\n", (unsigned long) netconn);
        abort();
    }

    int result = xQueueSend(event_queue, &event_descriptor, 0);
    if (result != pdTRUE) {
        fprintf(stderr, "socket: failed to enqueue: %i.\n", result);
    }
}

static term socket_addr_to_tuple(Context *ctx, ip_addr_t *addr)
{
    term addr_tuple;

    switch (IP_GET_TYPE(addr)) {
        case IPADDR_TYPE_V4: {
            uint8_t ad1 = ip4_addr1(&(addr->u_addr.ip4));
            uint8_t ad2 = ip4_addr2(&(addr->u_addr.ip4));
            uint8_t ad3 = ip4_addr3(&(addr->u_addr.ip4));
            uint8_t ad4 = ip4_addr4(&(addr->u_addr.ip4));
            addr_tuple = term_alloc_tuple(4, ctx);
            term_put_tuple_element(addr_tuple, 0, term_from_int11(ad1));
            term_put_tuple_element(addr_tuple, 1, term_from_int11(ad2));
            term_put_tuple_element(addr_tuple, 2, term_from_int11(ad3));
            term_put_tuple_element(addr_tuple, 3, term_from_int11(ad4));
            break;
        }

        case IPADDR_TYPE_V6:
            //TODO: implement IPv6
            addr_tuple = term_invalid_term();
            break;

        default:
            addr_tuple = term_invalid_term();
    }

    return addr_tuple;
}

static void tuple_to_ip_addr(term address_tuple, ip_addr_t *out_addr)
{
    out_addr->type = IPADDR_TYPE_V4;
    out_addr->u_addr.ip4.addr = htonl(socket_tuple_to_addr(address_tuple));
}


static term do_bind(Context *ctx, term params)
{
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    term address_term = interop_proplist_get_value(params, ADDRESS_ATOM);
    term port_term = interop_proplist_get_value(params, PORT_ATOM);

    UNUSED(address_term);

    u16_t port = term_to_int32(port_term);

    TRACE("socket: binding to IP_ADDR_ANY on port %i\n", (int) port);

    //TODO: replace IP_ADDR_ANY
    if (UNLIKELY(netconn_bind(socket_data->conn, IP_ADDR_ANY, port) != ERR_OK)) {
        TRACE("socket: Failed to bind\n");
        return port_create_sys_error_tuple(ctx, BIND_ATOM, errno);
    }

    ip_addr_t naddr;

    if (UNLIKELY(netconn_getaddr(socket_data->conn, &naddr, &port, 1) != ERR_OK)) {
        TRACE("socket: Failed to getaddr");
        return port_create_sys_error_tuple(ctx, GETSOCKNAME_ATOM, errno);
    } else {
        socket_data->port = port;
        TRACE("socket: bound to port %i\n", port);
        return OK_ATOM;
    }
}

static term init_udp_socket(Context *ctx, SocketDriverData *socket_data, term params, term active)
{
    TRACE("socket: creating udp netconn\n");

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_UDP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    int event_descriptor = open_event_descriptor(conn);
    TRACE("socket: opened event descriptor %i in init_udp_socket for netconn 0x%lx\n", event_descriptor, (unsigned long) socket_data->conn);
    term ret = do_bind(ctx, params);

    socket_data->active = active;
    if (ret == OK_ATOM && active == TRUE_ATOM) {
        EventListener *listener = malloc(sizeof(EventListener));
        if (IS_NULL_PTR(listener)) {
            fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            abort();
        }
        listener->fd = event_descriptor;
        listener->expires = 0;
        listener->expiral_timestamp.tv_sec = INT_MAX;
        listener->expiral_timestamp.tv_nsec = INT_MAX;
        listener->one_shot = 0;
        listener->data = ctx;
        listener->handler = active_recvfrom_callback;
        linkedlist_append(&ctx->global->listeners, &listener->listeners_list_head);
        socket_data->active_listener = listener;
        TRACE("socket: initialized\n");
    } else {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    return ret;
}

static term do_connect(SocketDriverData *socket_data, Context *ctx, term address, term port)
{
    // TODO handle IP addresses
    if (!term_is_list(address)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }

    int ok;
    char *addr_str = interop_term_to_string(address, &ok);
    if (!ok) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    TRACE("socket_driver: resolving %s ...\n", addr_str);

    struct ip_addr remote_ip;
    err_t status = netconn_gethostbyname(addr_str, &remote_ip);

    free(addr_str);

    if (status != ERR_OK) {
        // TODO atom
        return port_create_sys_error_tuple(ctx, UNDEFINED_ATOM, status);
    }

    int port_val = term_to_int(port);

    TRACE("socket_driver: connecting to port %i ...\n", port_val);
    status = netconn_connect(socket_data->conn, &remote_ip, port_val);

    if (status != ERR_OK) {
        // TODO atom
        return port_create_sys_error_tuple(ctx, CONNECT_ATOM, status);
    } else {
        TRACE("socket_driver: connected.\n");
        return OK_ATOM;
    }
}

static term init_client_tcp_socket(Context *ctx, SocketDriverData *socket_data, term params, term active)
{
    TRACE("socket: creating client tcp netconn\n");

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_TCP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    int event_descriptor = open_event_descriptor(conn);
    TRACE("socket: opened event descriptor %i in init_client_tcp_socket for netconn 0x%lx\n", event_descriptor, (unsigned long) socket_data->conn);

    term address = interop_proplist_get_value(params, ADDRESS_ATOM);
    term port = interop_proplist_get_value(params, PORT_ATOM);
    term ret = do_connect(socket_data, ctx, address, port);
    if (ret != OK_ATOM) {
        // TODO
        // close(sockfd);
    } else {
        if (active == TRUE_ATOM) {
            EventListener *listener = malloc(sizeof(EventListener));
            if (IS_NULL_PTR(listener)) {
                fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
                abort();
            }
            listener->fd = event_descriptor;
            listener->expires = 0;
            listener->expiral_timestamp.tv_sec = INT_MAX;
            listener->expiral_timestamp.tv_nsec = INT_MAX;
            listener->one_shot = 0;
            listener->data = ctx;
            listener->handler = active_recv_callback;
            linkedlist_append(&ctx->global->listeners, &listener->listeners_list_head);
            socket_data->active_listener = listener;
        }
    }
    return ret;
}

static term do_listen(SocketDriverData *socket_data, Context *ctx, term params)
{
    term backlog = interop_proplist_get_value(params, BACKLOG_ATOM);
    if (!term_is_integer(backlog)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    err_t status = netconn_listen_with_backlog(socket_data->conn, term_to_int(backlog));
    if (status == -1) {
        return port_create_sys_error_tuple(ctx, LISTEN_ATOM, errno);
    } else {
        return OK_ATOM;
    }
}

static term init_server_tcp_socket(Context *ctx, SocketDriverData *socket_data, term params)
{
    TRACE("socket: creating server tcp netconn\n");

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_TCP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    int event_descriptor = open_event_descriptor(conn);
    TRACE("socket: opened event descriptor %i in init_server_tcp_socket for netconn 0x%lx\n", event_descriptor, (unsigned long) socket_data->conn);

    term ret = do_bind(ctx, params);
    if (ret != OK_ATOM) {
        // TODO close
        // close(conn);
    } else {
        ret = do_listen(socket_data, ctx, params);
        if (ret != OK_ATOM) {
        // TODO close
        // close(conn);
        } else {
            // netconn_set_nonblocking(conn, 1);
            TRACE("socket: listening on port %u\n", (unsigned) term_to_int(interop_proplist_get_value(params, PORT_ATOM)));
        }
    }
    return ret;
}

static term init_accepting_socket(Context *ctx, SocketDriverData *socket_data, term fd, term active)
{
    TRACE("socket: init_accepting_socket\n");

