atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
    int event_descriptor = term_to_int(fd);
    socket_data->conn = (struct netconn *) get_event_ptr(event_descriptor);
    //
    //
    //
    if (active == TRUE_ATOM) {
        EventListener *listener = malloc(sizeof(EventListener));
        if (IS_NULL_PTR(listener)) {
            fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            abort();
        }
        listener->fd = event_descriptor;
        listener->expires = 0;
        listener->expiral_timestamp.tv_sec = INT_MAX;
        listener->expiral_timestamp.tv_nsec = INT_MAX;
        listener->one_shot = 0;
        listener->data = ctx;
        listener->handler = active_recv_callback;
        linkedlist_append(&ctx->global->listeners, &listener->listeners_list_head);
        socket_data->active_listener = listener;
    }
    return OK_ATOM;
}

term socket_driver_do_init(Context *ctx, term params)
{
    TRACE("socket: init\n");

    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    if (!term_is_list(params)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    term proto = interop_proplist_get_value(params, PROTO_ATOM);
    if (term_is_nil(proto)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    socket_data->proto = proto;
    //
    // get the controlling process
    //
    term controlling_process = interop_proplist_get_value_default(params, CONTROLLING_PROCESS_ATOM, term_invalid_term());
    if (!(term_is_invalid_term(controlling_process) || term_is_pid(controlling_process))) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    socket_data->controlling_process = controlling_process;
    //
    // get the binary flag
    //
    term binary = interop_proplist_get_value_default(params, BINARY_ATOM, TRUE_ATOM);
    if (!(binary == TRUE_ATOM || binary == FALSE_ATOM)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    socket_data->binary = binary;
    //
    // get the buffer size
    //
    term buffer = interop_proplist_get_value_default(params, BUFFER_ATOM, term_from_int(BUFSIZE));
    if (!term_is_integer(buffer)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    socket_data->buffer = buffer;
    //
    // get the active flag
    //
    term active = interop_proplist_get_value_default(params, ACTIVE_ATOM, FALSE_ATOM);
    socket_data->active = active;
    //
    // initialize based on specified protocol and action
    //
    if (proto == UDP_ATOM) {
        return init_udp_socket(ctx, socket_data, params, active);
    } else if (proto == TCP_ATOM) {
        term connect = interop_proplist_get_value_default(params, CONNECT_ATOM, FALSE_ATOM);
        if (connect == TRUE_ATOM) {
            return init_client_tcp_socket(ctx, socket_data, params, active);
        } else {
            term listen = interop_proplist_get_value_default(params, LISTEN_ATOM, FALSE_ATOM);
            if (listen == TRUE_ATOM) {
                return init_server_tcp_socket(ctx, socket_data, params);
            } else {
                term accept = interop_proplist_get_value_default(params, ACCEPT_ATOM, FALSE_ATOM);
                if (accept == TRUE_ATOM) {
                    term fd = interop_proplist_get_value(params, FD_ATOM);
                    if (!term_is_integer(fd)) {
                        return port_create_error_tuple(ctx, BADARG_ATOM);
                    } else {
                        return init_accepting_socket(ctx, socket_data, fd, active);
                    }
                } else {
                    return port_create_error_tuple(ctx, BADARG_ATOM);
                }
            }
        }
    } else {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
}

void socket_driver_do_close(Context *ctx)
{
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    if (socket_data->active == TRUE_ATOM) {
        linkedlist_remove(&ctx->global->listeners, &socket_data->active_listener->listeners_list_head);
    }
    if (netconn_close(socket_data->conn) != ERR_OK) {
        TRACE("socket: close failed");
    }
}

//
// INET API
//

term socket_driver_get_port(Context *ctx)
{
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    port_ensure_available(ctx, 7);
    return port_create_ok_tuple(ctx, term_from_int(socket_data->port));
}

//
// send operations
//

term socket_driver_do_send(Context *ctx, term buffer)
{
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    const char *buf = NULL;
    size_t len = 0;
    if (term_is_binary(buffer)) {
        buf = term_binary_data(buffer);
        len = term_binary_size(buffer);
    } else if (term_is_list(buffer)) {
        int ok;
        buf = interop_list_to_string(buffer, &ok);
        if (!ok) {
            // TODO error
        }
        len = strlen(buf);
    } else {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }

    err_t status = netconn_write(socket_data->conn, buf, len, NETCONN_NOCOPY);
    if (status != ERR_OK) {
        return port_create_sys_error_tuple(ctx, SEND_ATOM, status);
    } else {
        TRACE("socket_driver: sent data with len: %i\n", len);
        term sent_atom = term_from_int(len);
        return port_create_ok_tuple(ctx, sent_atom);
    }
}

term socket_driver_do_sendto(Context *ctx, term dest_address, term dest_port, term buffer)
{
    TRACE("socket: Going to send data\n");

    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    const char *buf = NULL;
    size_t len = 0;
    if (term_is_binary(buffer)) {
        buf = term_binary_data(buffer);
        len = term_binary_size(buffer);
    } else if (term_is_list(buffer)) {
        int ok;
        buf = interop_list_to_string(buffer, &ok);
        if (UNLIKELY(!ok)) {
            return port_create_error_tuple(ctx, BADARG_ATOM);
        }
        len = strlen(buf);
    } else {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }

    struct netbuf *sendbuf = netbuf_new();
    if (IS_NULL_PTR(sendbuf)) {
        TRACE("socket: netbuf alloc failed\n");
        return port_create_sys_error_tuple(ctx, SENDTO_ATOM, errno);
    }

    ip_addr_t ip4addr;
    tuple_to_ip_addr(dest_address, &ip4addr);
    uint16_t destport = term_to_int32(dest_port);

    TRACE("socket: send: data with len: %i, to: %x, port: %i\n", len, ip4addr.u_addr.ip4.addr, destport);

    if (UNLIKELY(netbuf_ref(sendbuf, buf, len) != ERR_OK)) {
        TRACE("socket: netbuf_ref fail\n");
        netbuf_delete(sendbuf);
        return port_create_sys_error_tuple(ctx, SENDTO_ATOM, errno);
    }

    if (UNLIKELY(netconn_sendto(socket_data->conn, sendbuf, &ip4addr, destport) != ERR_OK)) {
        TRACE("socket: send failed\n");
        netbuf_delete(sendbuf);
        return port_create_sys_error_tuple(ctx, SENDTO_ATOM, errno);
    }

    netbuf_delete(sendbuf);

    return port_create_ok_tuple(ctx, OK_ATOM);
}

//
// receive operations
//

typedef struct RecvFromData {
    Context *ctx;
    term pid;
    term length;
    uint64_t ref_ticks;
} RecvFromData;

static void active_recv_callback(EventListener *listener)
{
    Context *ctx = listener->data;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    struct netbuf *buf = NULL;

    if (UNLIKELY(netconn_recv(socket_data->conn, &buf) != ERR_OK)) {
        // {tcp, Socket, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = socket_data->controlling_process;
        term msgs[2] = {TCP_CLOSED_ATOM, term_from_local_process_id(ctx->process_id)};
        term msg = port_create_tuple_n(ctx, 2, msgs);
        port_send_message(ctx, pid, msg);
        socket_driver_do_close(ctx);
    } else {
        void *data;
        u16_t data_len;
        netbuf_data(buf, &data, &data_len);

        TRACE("socket_driver: active received data of len: %i\n", data_len);
        // {tcp, pid, binary}
        port_ensure_available(ctx, 20 + data_len/(TERM_BITS/8) + 1);
        term pid = socket_data->controlling_process;
        term packet = socket_create_packet_term(ctx, data, data_len, socket_data->binary == TRUE_ATOM);
        term msgs[3] = {TCP_ATOM, term_from_local_process_id(ctx->process_id), packet};
        term msg = port_create_tuple_n(ctx, 3, msgs);
        port_send_message(ctx, pid, msg);
    }
    netbuf_delete(buf);
}

static void passive_recv_callback(EventListener *listener)
{
    RecvFromData *recvfrom_data = (RecvFromData *) listener->data;
    Context *ctx = recvfrom_data->ctx;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    //
    // receive the data
    //
    struct netbuf *buf = NULL;
    if (UNLIKELY(netconn_recv(socket_data->conn, &buf) != ERR_OK)) {
        // {Ref, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        port_send_reply(ctx, pid, ref, port_create_sys_error_tuple(ctx, RECV_ATOM, errno));
    } else {
        void *data;
        u16_t data_len;
        netbuf_data(buf, &data, &data_len);

        TRACE("socket_driver: passive received data of len: %i\n", data_len);
        port_ensure_available(ctx, 20 + data_len/(TERM_BITS/8) + 1);
        // {Ref, {ok, Packet::binary()}}
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        term packet = socket_create_packet_term(ctx, data, data_len, socket_data->binary == TRUE_ATOM);
        term reply = port_create_ok_tuple(ctx, packet);
        port_send_reply(ctx, pid, ref, reply);
    }
    //
    // remove the EventListener from the global list and clean up
    //
    linkedlist_remove(&ctx->global->listeners, &listener->listeners_list_head);
    free(listener);
    free(recvfrom_data);
    netbuf_delete(buf);
}

static void active_recvfrom_callback(EventListener *listener)
{
    Context *ctx = listener->data;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    struct netbuf *buf = NULL;

    if (UNLIKELY(netconn_recv(socket_data->conn, &buf) != ERR_OK)) {
        // {udp, Socket, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = socket_data->controlling_process;
        term msgs[5] = {UDP_ATOM, term_from_local_process_id(ctx->process_id), port_create_sys_error_tuple(ctx, RECVFROM_ATOM, errno)};
        term msg = port_create_tuple_n(ctx, 5, msgs);
        port_send_message(ctx, pid, msg);

    } else {
        void *data;
        uint16_t datalen;
        netbuf_data(buf, &data, &datalen);
        // {udp, pid, {int,int,int,int}, int, binary}
        port_ensure_available(ctx, 20 + datalen/(TERM_BITS/8) + 1);
        term pid = socket_data->controlling_process;
        term addr = socket_addr_to_tuple(ctx, netbuf_fromaddr(buf));
        term port = term_from_int32(netbuf_fromport(buf));
        term packet = socket_create_packet_term(ctx, data, datalen, socket_data->binary == TRUE_ATOM);
        term msgs[5] = {UDP_ATOM, term_from_local_process_id(ctx->process_id), addr, port, packet};
        term msg = port_create_tuple_n(ctx, 5, msgs);
        port_send_message(ctx, pid, msg);
    }
    netbuf_delete(buf);
}

static void passive_recvfrom_callback(EventListener *listener)
{
    RecvFromData *recvfrom_data = (RecvFromData *) listener->data;
    Context *ctx = recvfrom_data->ctx;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    struct netbuf *buf = NULL;

    if (UNLIKELY(netconn_recv(socket_data->conn, &buf) != ERR_OK)) {
        // {Ref, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = socket_data->controlling_process;
        term ref = term_from_ref_ticks(socket_data->ref_ticks, ctx);
        port_send_reply(ctx, pid, ref, port_create_sys_error_tuple(ctx, RECVFROM_ATOM, errno));

    } else {
        void *data;
        uint16_t datalen;
        netbuf_data(buf, &data, &datalen);
        // {Ref, {ok, {{int,int,int,int}, int, binary}}}
        port_ensure_available(ctx, 20 + datalen/(TERM_BITS/8) + 1);

