atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
        term ref = term_from_ref_ticks(socket_data->ref_ticks, ctx);
        term addr = socket_addr_to_tuple(ctx, netbuf_fromaddr(buf));
        term port = term_from_int32(netbuf_fromport(buf));
        term packet = term_from_literal_binary(data, datalen, ctx);
        term addr_port_packet = port_create_tuple3(ctx, addr, port, packet);
        term reply = port_create_ok_tuple(ctx, addr_port_packet);
        port_send_reply(ctx, socket_data->controlling_process, ref, reply);
    }
    //
    // remove the EventListener from the global list and clean up
    //
    linkedlist_remove(&ctx->global->listeners, &listener->listeners_list_head);
    free(listener);
    free(recvfrom_data);
    netbuf_delete(buf);
}

static void do_recv(Context *ctx, term pid, term ref, term length, term timeout, event_handler_t handler)
{
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    //
    // The socket must be in active mode
    //
    if (socket_data->active == TRUE_ATOM) {
        port_ensure_available(ctx, 12);
        port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
        return;
    }
    //
    // Create and initialize the request-specific data
    //
    RecvFromData *data = (RecvFromData *) malloc(sizeof(RecvFromData));
    if (IS_NULL_PTR(data)) {
        fprintf(stderr, "Unable to allocate space for RecvFromData: %s:%i\n", __FILE__, __LINE__);
        abort();
    }
    data->ctx = ctx;
    data->pid = pid;
    data->length = length;
    data->ref_ticks = term_to_ref_ticks(ref);
    //
    // Look up the event descriptor for our socket
    //
    int event_descriptor = find_event_descriptor(socket_data->conn);
    if (UNLIKELY(event_descriptor < 0)) {
        TRACE("socket: event descriptor not found in do_recv for netconn 0x%lx\n", (unsigned long)socket_data->conn);
        abort();
    }
    //
    // Create an event listener with this request-specific data, and append to the global list
    //
    EventListener *listener = malloc(sizeof(EventListener));
    if (IS_NULL_PTR(listener)) {
        fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        abort();
    }
    listener->fd = event_descriptor;
    listener->expires = 0;
    listener->expiral_timestamp.tv_sec = 60*60*24; // TODO handle timeout
    listener->expiral_timestamp.tv_nsec = 0;
    listener->one_shot = 1;
    listener->handler = handler;
    listener->data = data;
    linkedlist_append(&ctx->global->listeners, &listener->listeners_list_head);
}

void socket_driver_do_recvfrom(Context *ctx, term pid, term ref, term length, term timeout)
{
    do_recv(ctx, pid, ref, length, timeout, passive_recvfrom_callback);
}

void socket_driver_do_recv(Context *ctx, term pid, term ref, term length, term timeout)
{
    do_recv(ctx, pid, ref, length, timeout, passive_recv_callback);
}

//
// accept
//

static void accept_callback(EventListener *listener)
{
    TRACE("socket: accepting callback\n");

    RecvFromData *recvfrom_data = (RecvFromData *) listener->data;
    Context *ctx = recvfrom_data->ctx;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    //
    // Look up the event descriptor for our socket
    //
    int event_descriptor = find_event_descriptor(socket_data->conn);
    if (UNLIKELY(event_descriptor < 0)) {
        TRACE("socket: event descriptor not found in accept_callback for netconn 0x%lx\n", (unsigned long)socket_data->conn);
        abort();
    } else {
        TRACE("socket: Found event descriptor in accept_callback for netconn 0x%lx\n", (unsigned long)socket_data->conn);
    }
    //
    // accept the connection
    //
    struct netconn *conn;
    err_t status = netconn_accept(socket_data->conn, &conn);
    TRACE("socket: netconn_accept: status: %i; conn: 0x%lx\n", status, (unsigned long) conn);
    if (status != ERR_OK) {
        // {Ref, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        port_send_reply(ctx, pid, ref, port_create_sys_error_tuple(ctx, ACCEPT_ATOM, errno));
    } else {
        TRACE("socket: accepted new connection\n");
        int new_event_descriptor = open_event_descriptor(conn);
        TRACE("socket: opened event descriptor %i in accept_callback for netconn 0x%lx\n", new_event_descriptor, (unsigned long) conn);
        // {Ref, {ok, Fd::int()}}
        port_ensure_available(ctx, 10);
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        term reply = port_create_ok_tuple(ctx, term_from_int(new_event_descriptor));
        TRACE("socket: sending reply\n");
        port_send_reply(ctx, pid, ref, reply);
    }
    //
    // remove the EventListener from the global list and clean up
    //
    linkedlist_remove(&ctx->global->listeners, &listener->listeners_list_head);
    free(listener);
    free(recvfrom_data);
    TRACE("socket: accept_callback done.\n");
}

void socket_driver_do_accept(Context *ctx, term pid, term ref, term timeout)
{
    TRACE("socket: accepting tcp netconn\n");

    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    //
    // Create and initialize the request-specific data
    //
    RecvFromData *data = (RecvFromData *) malloc(sizeof(RecvFromData));
    if (IS_NULL_PTR(data)) {
        fprintf(stderr, "Unable to allocate space for RecvFromData: %s:%i\n", __FILE__, __LINE__);
        abort();
    }
    data->ctx = ctx;
    data->pid = pid;
    data->length = 0;
    data->ref_ticks = term_to_ref_ticks(ref);
    //
    // Look up the event descriptor for our socket
    //
    int event_descriptor = find_event_descriptor(socket_data->conn);
    if (UNLIKELY(event_descriptor < 0)) {
        TRACE("socket: event descriptor not found in socket_driver_do_accept for netconn 0x%lx\n", (unsigned long)socket_data->conn);
        abort();
    } else {
        TRACE("socket: Found event descriptor in socket_driver_do_accept for netconn 0x%lx\n", (unsigned long)socket_data->conn);
    }
    //
    // Create an event listener with this request-specific data, and append to the global list
    //
    EventListener *listener = malloc(sizeof(EventListener));
    if (IS_NULL_PTR(listener)) {
        fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        abort();
    }
    listener->fd = event_descriptor;
    listener->expires = 0;
    listener->expiral_timestamp.tv_sec = 60*60*24; // TODO handle timeout
    listener->expiral_timestamp.tv_nsec = 0;
    listener->one_shot = 1;
    listener->handler = accept_callback;
    listener->data = data;
    linkedlist_append(&ctx->global->listeners, &listener->listeners_list_head);
    TRACE("socket: accepting tcp netconn COMPLETE\n");
}
